
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Склад Расход
	Движения.Склад.Записывать = Истина;
	Движения.Склад.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовары.Товар КАК Товар,
		|	СУММА(ПродажаТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Продажа.Товары КАК ПродажаТовары
		|ГДЕ
		|	ПродажаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовары.Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Товар КАК Товар,
		|	ВТ.Количество КАК Количество,
		|	ЕСТЬNULL(СкладОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Склад.Остатки(
		|				&МоментВремени,
		|				Товар В
		|					(ВЫБРАТЬ
		|						ВТ.Товар
		|					ИЗ
		|						ВТ)) КАК СкладОстатки
		|		ПО (СкладОстатки.Товар = ВТ.Товар)";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток < ВыборкаДетальныеЗаписи.Количество  Тогда
			Сообщить(СтрШаблон("Не хватает остатки по номенклатуре %1, в документе %2 шт, на складе %3 шт", 
			ВыборкаДетальныеЗаписи.Товар, ВыборкаДетальныеЗаписи.Количество, ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Отказ = Истина;
		КонецЕсли;
		
		Движение = Движения.Склад.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
		Движение.Количество = Мин(ВыборкаДетальныеЗаписи.Количество, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		
	КонецЦикла;

КонецПроцедуры
